print('Задача 4. Простые числа')

# Напишите программу, которая считает количество простых чисел в заданной последовательности и выводит ответ на экран.

# Простое число делится только на себя и на единицу. Последовательность задаётся при помощи вызова ввода (input) на каждой итерации цикла. Одна итерация — одно число.

# Пример:
# Введите количество чисел: 6.
# Введите число: 4.
# Введите число: 7.
# Введите число: 20.
# Введите число: 3.
# Введите число: 11.
# Введите число: 37.

# Количество простых чисел в последовательности: 4.

start = True
num_count =0
multi =int(input('\nВведите количество чисел: '))
while start:
    for num in range(multi):
        number =int(input('Введите число: '))
        if number % number == 0 and  not number % 2 ==0:
            num_count += 1
    print('\nКоличество простых чисел в последовательности: ', num_count)